{
    "HEADER": {
        "Home": "Home",
        "AboutMe": "About Me",
        "Projects": "Projects",
        "Experiences": "Experiences",
        "Contact": "Contact",
        "Resume": "Resume"
    },
    "HOME": {
        "NAME": "Jeffer Peng",
        "DESCRIPTION": "Student, Software Developer"
    },
    "TECH_LIST": {
        "TITLE": "Some techs that I have used",
        "FRONT_END": "Front End",
        "BACK_END": "Back End",
        "DATA_SCIENCE": "Data Science",
        "OTHERS": "Others"
    },
    "ABOUT_ME": {
        "HEADER": "About Me",
        "DESCRIPTION": "Hi there! My name is Jeffer Peng. I am an undergrad student majoring in Computer Science at University of Waterloo.",
        "EXPERIENCES_DESCRIPTION": "Experienced in full stack development, algorithms and data structures, and Object Oriented programming. I always bring 100% to the work I do and I am not afraid to take initiative and seek new challenges.",
        "Name": "Name",
        "DateOfBirth": "Date of Birth",
        "DateOfBirthVal": "Dec.21st 1998",
        "Email": "Email",
        "Languages": "Languages",
        "LanguagesVal": "English, Chinese Mandarin"
    },
    "PROJECTS": {
        "PROJECTS": "Projects"
    },
    "CONTACT_ME": {
        "CONTACT_ME": "Contact Me"
    },
    "DarwinAI": {
        "TITLE": "Full Stack developer Internship",
        "DESCRIPTION_1": {
            "TITLE": "Lead full-stack development for COVID-Net platform in React and python to provide AI screening and risk stratification of COVID-19 to 23 hospitals",
            "D1_D1": "Built DICOM image viewer in React to perform drag, zoom, invert, and window/level on image",
            "D1_D2": "Developed all React components in function component with hooks and context to greatly reduce amount of code by >10%",
            "D1_D3": "Developed containerized ChRIS backend plugins in python to run COVID-Net ML models and generate analysis results in PDF"
        },
        "GENSYNTH": {
            "TITLE": "Contributed to development of company's core product using Angular6, Node and completed 5 major features and 30 minor feature/bug fix tickets",
            "D1":"Revamped and Implemented new job visualization UI using directed graph to accommodate new key feature and increased test coverage by 10%",
            "D2":"Implemented delete api on model training cycles using Node, Objection.ts to allow users to free up database and server memory"
        }
    },
    "CAPCO": {
        "TITLE": "Software Engineering Internship",
        "DESCRIPTION_1": {
            "TITLE": "Prototyped in a small team the full stack of Object Model Mapper with react for BSAs to automate object modeling process. Distributed the app in both web-based and standalone desktop versions.",
            "D1_D1": "Utilized MongoDB to store data for web-based version and used Node to store data as files for desktop version",
            "D1_D2": "The desktop version is built by packaging the react app using Electron and having the server as a dependency"
        },
        "DESCRIPTION_2": {
            "TITLE": "Developed the full stack of two Angular Proof of Concepts(POC) apps both independently and in small agile teams for bank clients",
            "D2_D1": "Angular POC 1 helps Payment Service Providers to register with the bank client through a set of registration proccess",
            "D2_D2": "Angular POC 2 helps HR to automate the onboarding process of new employees and see employees' progress in registration",
            "D2_D3": "Example Feature: Implemented elastic search algorithm in backend for type ahead searches in angular app"
        }
    },
    "MMC": {
        "TITLE": "Software Developer Internship",
        "DESCRIPTION_1": {
            "TITLE": "Independently developed a mobile app where insurance agents can review business data for company’s clients"
        },
        "DESCRIPTION_2": {
            "TITLE": "Added Redux reducers and actions to update the store and increase code maintainability"
        },
        "DESCRIPTION_3": {
            "TITLE": "Successfully released the mobile app to production after numerous demo and feedback cycles"
        }
    },
    "Perfect Financial Solutions": {
        "TITLE": "Web Developer",
        "DESCRIPTION_1": {
            "TITLE": "Developed a PHP program to manage a SQL client database to automate file filling and printing process"
        },
        "DESCRIPTION_2": {
            "TITLE": "Created the full stack of a business information system for the company to manage client files, and for clients to create account, retrieve password and view their files upon login."
        },
        "DESCRIPTION_3": {
            "TITLE": "Built interactive front-end web pages and created backend of aforementioned systems with PHP"
        }
    }
}